# StructuralConnectionHandler Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandler Class
Members See Also
---
An object of Structural Connection Handler.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class StructuralConnectionHandler : Element
```

Visual Basic
---
```text
Public Class StructuralConnectionHandler _
	Inherits Element
```

Visual C++
---
```text
public ref class StructuralConnectionHandler : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..StructuralConnectionHandler
# See Also
StructuralConnectionHandler Members
Autodesk.Revit.DB.Structure Namespace